#!/bin/bash

set -e

echo "=============================="
echo "1. Создание наборов данных"
echo "=============================="
python3 data_creation.py

echo "=============================="
echo "2. Предобработка данных"
echo "=============================="
python3 model_preprocessing.py

echo "=============================="
echo "3. Создание и обучение модели"
echo "=============================="
python3 model_preparation.py

echo "=============================="
echo "4. Тестирование модели"
echo "=============================="
python3 model_testing.py

echo "=============================="
echo "Конец"
echo "=============================="
